package com.kh.mini.model.dao;

import com.kh.mini.model.vo.Book;

public class BookDB {
	
	Book[] books=new Book[45];
	
	public Book[] saveBook() {
		//책 이름과 정보들을 저장해놓는 DB클래스
		
		//학습서.
		books[0]=new Book("자바의 정석", "남궁성", "도우출판", "학습서","0.jpg","","");
		books[1]=new Book("혼자 공부하는 자바", "신용권", "한빛미디어", "학습서","1.jpg","","");
		books[2]=new Book("Do it! 자바 프로그래밍 입문 ", "박은종", "이지스퍼블리싱", "학습서","2.jpg","","");
		books[3]=new Book("이것이 자바다", "신용권", "한빛미디어", "학습서","3.jpg","","");
		books[4]=new Book("어서와 Java는 처음이지", "천인국", "인피니티북스", "학습서","4.jpg","","");
		
		
		//소설.
		books[5]=new Book("기억", "베르나르 베르베르", "열린책들", "소설","5.jpg","","");
		books[6]=new Book("봉제인형 살인사건", "다니엘 콜", "북플라자", "소설","6.jpg","","");
		books[7]=new Book("페스트 ", "알베르 카뮈", "민음사", "소설","7.jpg","","");
		books[8]=new Book("소년이 온다", "한강", "창비", "소설","8.jpg","","");
		books[9]=new Book("데미안", "헤르만 헤세" , "더스토리 ", "소설","9.jpg","","");
		
		
		//만화.		
		books[10]=new Book("원피스", "오다 에이치로", "대원아이씨", "만화","10.jpg","","");
		books[11]=new Book("오무라이스 잼잼", "조경규", "송송책방", "만화","11.jpg","","");
		books[12]=new Book("연의 편지", "조현아", "대원아이씨", "만화","12.jpg","","");
		books[13]=new Book("슬램덩크 ", "이노우에 타케히코", "대원아이씨", "만화","13.jpg","","");
		books[14]=new Book("진격의 거인", "이사야마 하지메", "학산문화사", "만화","14.jpg","","");
		
		
		//요리.
		books[15]=new Book("맛있게 살 빠지는 고단백 저탄수화물 다이어트 레시피", "미니 박지우", "비에이블", "요리","15.jpg","","");
		books[16]=new Book("만원으로 일주일 반찬 만들기", "송혜영", "길벗", "요리","16.jpg","","");
		books[17]=new Book("한 그릇 뚝딱 유아식", "오상민,박현영", "청림라이프", "요리","17.jpg","","");
		books[18]=new Book("백종원이 추천하는 집밥 메뉴56", "백종원", "서울문화사", "요리","18.jpg","","");
		books[19]=new Book("진짜 기본 요리책", "월간 수퍼레시피", "레시피팩토리", "요리","19.jpg","","");
		
		
		//여행.
		books[20]=new Book("트래블러 아르헨티나", "트래블러 제작진", "오렌지디", "여행","20.jpg","","");
		books[21]=new Book("한번쯤 포르투갈", "허혜영", "앤에이북스", "여행","21.jpg","","");
		books[22]=new Book("여행의 이유", "김영하", "문학동네", "여행","22.jpg","","");
		books[23]=new Book("한달 쯤 런던", "황소영", "봄엔", "여행","23.jpg","","");
		books[24]=new Book("지금이 아니면 안될 것 같아서", "홍인혜", "달", "여행","24.jpg","","");
	
		
		//시집.
		books[25]=new Book("시를 잊은 그대에게", "정재찬", "휴머니스트", "시집","25.jpg","","");
		books[26]=new Book("헤르만 헤세 시집", "헤르만헤세", "문예출판사", "시집","26.jpg","","");
		books[27]=new Book("윤동주 시집", "윤동주", "범우사", "시집","27.jpg","","");
		books[28]=new Book("서랍을 저녁에 넣어두었다", "한강", "문학과 지성", "시집","28.jpg","","");
		books[29]=new Book("입 속의 검은 잎", "기형도", "문학과 지성", "시집","29.jpg","","");
		
		
		//건강.
		books[30]=new Book("영양의 비밀","프레드 프로벤자","브론스테인","건강","30.jpg","","");
		books[31]=new Book("먹어서 병을 이기는 법","윌리엄 리","흐름출판","건강","31.jpg","","");
		books[32]=new Book("백년 운동","정선근","아티잔","건강","32.jpg","","");
		books[33]=new Book("이기는 몸","이동환","쌤앤파커스","건강","33.jpg","","");
		books[34]=new Book("인요가","폴 그릴리","판미동","건강","34.jpg","","");
		
		
		//어린이.
		books[35]=new Book("추리 천재 엉덩이 탐정","트롤","아이세움","어린이","35.jpg","","");
		books[36]=new Book("무지개 물고기와 특별한 친구","마르쿠스 피스터","시공주니어","어린이","36.jpg","","");
		books[37]=new Book("나는 개다","백희나","책읽는곰","어린이","37.jpg","","");
		books[38]=new Book("단추 스프","오브리 데이비스","국민서관","어린이","38.jpg","","");
		books[39]=new Book("구름빵","백희나","한솔수북","어린이","39.jpg","","");
		
		
		//에세이.
		books[40]=new Book("여행의 이유","김영하","문학동네","에세이","40.jpg","","");
		books[41]=new Book("하마터면 열심히 살 뻔했다","하완","웅진지식하우스","에세이","41.jpg","","");
		books[42]=new Book("나는 나로 살기로 했다","김수현","마음의숲","에세이","42.jpg","","");
		books[43]=new Book("곰돌이 푸, 행복한 일은 매일 있어","곰돌이 푸","알에이치코리아","에세이","43.jpg","","");
		books[44]=new Book("언어의 온도","이기주","말글터","에세이","44.jpg","","");
//		
		return books;
		
	}
	
	

}